---
kind: method
id: M:Autodesk.Revit.DB.FilterStringContains.#ctor
source: html/e0cd9ffc-3963-a4d6-0114-9563f6ccdaee.htm
---
# Autodesk.Revit.DB.FilterStringContains.#ctor Method

Constructs an instance of FilterStringContains.

## Syntax (C#)
```csharp
public FilterStringContains()
```